# Pandas Library

 <h1 style="text-align: justify; direction:rtl"> 
   درس 10: کار با کتابخانه Pandas 
</h1>

In [1]:
import pandas as pd
import numpy as np

 <h2 style="text-align: justify; direction:rtl"> 
 1. سری ها 
</h2>

In [5]:
x0 = [5,3,8,7]
s1 = pd.Series(x0)
s1

0    5
1    3
2    8
3    7
dtype: int64

In [6]:
s1.values

array([5, 3, 8, 7], dtype=int64)

In [7]:
s2 = pd.Series(x0,index=['a','b','c','d'])
s2

a    5
b    3
c    8
d    7
dtype: int64

In [8]:
s2['b']

3

In [9]:
s2[1]

3

In [10]:
s2[['a','d']]

a    5
d    7
dtype: int64

In [11]:
np.sqrt(s2)

a    2.236068
b    1.732051
c    2.828427
d    2.645751
dtype: float64

In [12]:
s2

a    5
b    3
c    8
d    7
dtype: int64

In [13]:
'a' in s2

True

In [14]:
'f' in s2

False

In [15]:
8 in s2

False

In [2]:
# ساخت سری از یک دیکشنری

data = {'Bushehr':25000,'Borazjan':12000,'Kangan':1500}
s3 = pd.Series(data)
s3

Bushehr     25000
Borazjan    12000
Kangan       1500
dtype: int64

In [9]:
city = ['Kangan','Bushehr','Borazjan']
s4 = pd.Series(data,index=city)
s4

Kangan       1500.0
Bushehr     25000.0
Borazjan    12000.0
dtype: float64

In [8]:
city = ['Kangan','Bushehr','Borazjan','Khormoj']
s5 = pd.Series(data,index=city)
s5

Kangan       1500.0
Bushehr     25000.0
Borazjan    12000.0
Khormoj         NaN
dtype: float64

In [10]:
s5.isnull()

Kangan      False
Bushehr     False
Borazjan    False
Khormoj      True
dtype: bool

In [11]:
pd.isnull(s5)

Kangan      False
Bushehr     False
Borazjan    False
Khormoj      True
dtype: bool

In [12]:
pd.Series(5,index=range(7))

0    5
1    5
2    5
3    5
4    5
5    5
6    5
dtype: int64

 <h3 style="text-align: justify; direction:rtl"> 
 2. داده های چارچوب دار 
</h3>

## DataFrame

In [5]:
data = {'Name':['Ahmad','Zahra','Ali'],
        'Amar':[20,18,19],
        'Computer':[18,19,17]}      
data

{'Name': ['Ahmad', 'Zahra', 'Ali'],
 'Amar': [20, 18, 19],
 'Computer': [18, 19, 17]}

In [6]:
f1 = pd.DataFrame(data)
f1

    Name  Amar  Computer
0  Ahmad    20        18
1  Zahra    18        19
2    Ali    19        17

In [18]:
f2 = pd.DataFrame(data,columns=['Name','Amar','Riazi'])
f2

    Name  Amar Riazi
0  Ahmad    20   NaN
1  Zahra    18   NaN
2    Ali    19   NaN

In [19]:
f1['Computer']

0    18
1    19
2    17
Name: Computer, dtype: int64

In [20]:
f1.Computer

0    18
1    19
2    17
Name: Computer, dtype: int64

In [24]:
D = {'Vorudi':[97,97,97,98,98,98],
    'Signal':[18,17,16,15,16,17],
    'Computer':[18,19,17,19,18,17]}
f2 = pd.DataFrame(D,index=[9712,9710,9718,9817,9816,9815])
f2

      Vorudi  Signal
9712      97      18
9710      97      19
9718      97      17
9817      98      19
9816      98      18
9815      98      17

In [25]:
f2.B1

9712    18
9710    19
9718    17
9817    19
9816    18
9815    17
Name: B1, dtype: int64

In [12]:
f2.loc[9718]

Vorudi      97
Signal      16
Computer    17
Name: 9718, dtype: int64

In [30]:
f2[0:2]

      Vorudi  Vajeh  B1
9712      97     18  18
9710      97     17  19

In [13]:
f2['Computer']

9712    18
9710    19
9718    17
9817    19
9816    18
9815    17
Name: Computer, dtype: int64

In [32]:
f2.iloc[0:2,0:2]

      Vorudi  Vajeh
9712      97     18
9710      97     17

In [16]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [19]:
frame[1:2]

  state  year  pop
1  Ohio  2001  1.7

In [23]:
frame['x'] = np.arange(-1,4)
frame

    state  year  pop  x
0    Ohio  2000  1.5 -1
1    Ohio  2001  1.7  0
2    Ohio  2002  3.6  1
3  Nevada  2001  2.4  2
4  Nevada  2002  2.9  3

In [26]:
# حذف یک ستون
del frame['x']
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [15]:
frame.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9]], dtype=object)

## Summarizing and Computing Descriptive Statistics

In [29]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
                index=['a', 'b', 'c', 'd'],
                columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [30]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [31]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [20]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [33]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [22]:
df.idxmax()

one    b
two    d
dtype: object

In [35]:
A=df.describe()
A

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [39]:
A[2:3]

          one       two
std  3.493685  2.262742

## GroupBy

In [50]:
import pandas as pd
import numpy as np
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [51]:
grouped = df.groupby('Year')
grouped

In [65]:
for name,group in grouped:
#    print (name)
   print (group)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

### Select a Group

In [9]:
grouped.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [56]:
a=[3,6,1,8]
for i,j in enumerate(a):
    print('i=',i,', j=',j)

i= 0 , j= 3
i= 1 , j= 6
i= 2 , j= 1
i= 3 , j= 8

### Aggregations¶

In [11]:
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [57]:
grouped2 = df.groupby('Team')
grouped2['Points'].agg(np.size)

Team
Devils    2
Kings     3
Riders    4
Royals    2
kings     1
Name: Points, dtype: int64

In [58]:
grouped2['Points'].agg([np.size, np.mean, np.std])

        size        mean         std
Team
Devils     2  768.000000  134.350288
Kings      3  761.666667   24.006943
Riders     4  762.250000   88.567771
Royals     2  752.500000   72.831998
kings      1  812.000000         NaN

## Pandas - IO Tools

### Reading files

In [3]:
import pandas as pd
df=pd.read_csv("Datasets/temp.csv")
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [61]:
df=pd.read_csv("Datasets/temp.csv",
               index_col=['S.No'])
df

        Name  Age       City  Salary
S.No
1        Tom   28    Toronto   20000
2        Lee   32   HongKong    3000
3     Steven   43   Bay Area    8300
4        Ram   38  Hyderabad    3900

In [13]:
df=pd.read_excel("Datasets/temp.xlsx")
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [9]:
df2=pd.read_excel("Datasets/temp_per.xlsx")
df2

     نام نام خانوادگی  ورودی   معدل
0    علی        احمدی    911  15.64
1   حسین        روستا    921  14.43
2  فاطمه       رمضانی    931  16.00

In [63]:
df2=pd.read_csv("Datasets/temp_per.txt"
                ,sep='\t')
df2

     نام نام خانوادگی  ورودی   معدل
0    علی        احمدی    911  15.64
1   حسین        روستا    921  14.43
2  فاطمه       رمضانی    931  16.00

### Writing files

In [14]:
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [15]:
df.to_csv('Datasets/temp1.csv',index=False)

In [16]:
df2.to_csv('Datasets/temp1_per.txt',index=False,sep='\t')

In [ ]:
df2.to_excel('Datasets/temp1_per.xlsx',index=False)